"""
Задание №2
✔ Самостоятельно сохраните в переменной строку текста.
✔ Создайте из строки словарь, где ключ — буква, а значение — код буквы.
✔ Напишите преобразование в одну строку.
"""

text = "kdhkjhjshfvcoxkv"

dict_res = {i : ord(i) for i in text}

print(dict_res)




"""
Задание №3
✔ Продолжаем развивать задачу 2.
✔ Возьмите словарь, который вы получили.
Сохраните его итераторатор.
✔ Далее выведите первые 5 пар ключ-значение,
обращаясь к итератору, а не к словарю."""

new_dict = iter(dict_res.items())
for _ in range(5):
    print(next(new_dict))